#include <stdio.h>

int main()
{
	int i1, i2=0, i3=0, i4[10]={0,0,0,0,0,0,0,0,0,0};

	//i3 признак выполнени€ услови€ задачи
	//i4 массив, где будем считать, сколько раз встречаетс€ кажда€ цифра, в начале все количества равны нулю 

	do {
		scanf("%d", &i1);
	} while (i1<0); 
    
	do{
		i2=i1%10;//определ€ем следующую цифру, она последн€€ в числе

		i1=(i1-i2)/10;//сдвигаем цифры на один разр€д вправо, т.е. забываем последнюю цифру
		i3=++i4[i2]>1;//т.к. цифр 10, количество считаем в элементе массива с соответствующим индексом, 
				сразу провер€ем, что воличество больше 1 и устанавливаем признак i4, 
				что условие задачи выполнилось, дальше дело техники

	} while(i1>0 && !i3);//из цикла выходим, если кончились цифры или если выполнилось условие задачи 
	 
	printf("%s", i3 ? "YES":"NO");
    
	return 0;
}
